import { useSelector } from "react-redux";
import styled from "./aboutus.module.css";

function Aboutus() {
  const theme = useSelector((state) => state.theme.value);

  return (
    <div
      style={{ backgroundColor: theme ? "yellow" : "black" }}
      className={styled.container}
    >
      <p>
      جامعه‌شناسی (به انگلیسی: Sociology) یکی از علوم اجتماعی است که بر بررسی جامعه، رفتار اجتماعی انسان، الگوهای مناسبات اجتماعی، رابطه اجتماعی و جنبه‌هایی از فرهنگ مرتبط با زندگی روزمره تمرکز دارد. از روش‌های مختلف پژوهش تجربی و تفکر انتقادی برای توسعه مجموعه‌ای از دانش در مورد نظم اجتماعی و تغییر اجتماعی استفاده می‌کند. در حالی که برخی از جامعه‌شناسان پژوهش‌هایی را انجام می‌دهند که ممکن است مستقیماً برای رفاه و سیاست اجتماعی اِعمال شود، برخی دیگر عمدتاً بر اصلاح نظری درک فرآیندهای اجتماعی و روش پدیدارشناسی تمرکز می‌کنند. موضوع می‌تواند از تحلیل‌های سطح جامعه‌شناسی خرد (یعنی تعامل فردی و عاملیت) تا تحلیل‌های سطح جامعه‌شناسی کلان جامعه (یعنی نظام اجتماعی و ساختار اجتماعی) سیر نماید.
      </p>
    </div>
  );
}

export default Aboutus;
